[{"title":"Amnesia: The Dark Descent","summary":"With its first-person perspective, claustrophobic environments, and the complete defenselessness of its protagonist, Amnesia: The Dark Descent helped set the standard for horror gaming this decade. Even after you learn the game’s tricks, it can take a lot of convincing to get you to dive into Amnesia’s haunted halls. This title stands alone as a testament to the power of horror in gaming and proof that atmosphere is one of those sometimes intangible things that video games uniquely excel at over other mediums. – MB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/amnesia-the-dark-descent.png","platform":"PC, PS4, XBO, Switch","date":"2010","key":0},{"title":"Return of the Obra Dinn","summary":"Here’s the pitch: you’re an insurance investigator who must examine a recently returned ship known as the Obra Dinn to figure out what happened to the vanished souls that once inhabited it (and how much the whole thing is going to cost your company). The twist is that you also have access to a mystical stopwatch that allows you to turn back time and view the crew’s final moments.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/return-of-the-obra-dinn.jpg","platform":"PC, PS4, XBO, Switch","date":"2018","key":1},{"title":"World of Warcraft Classic","summary":"It’s tempting to dismiss World of Warcraft Classic as a nostalgia trip, but it’s not quite that. It’s an epic adventure to a bygone era when the seemingly infinite possibilities of creating an online world inspired an intrepid group of developers to go for broke with an MMORPG. Word of Warcraft Classic shows its age at times, but even the game’s rough edges are a testament to the spirit of adventure, the thrill of discovery, and the joys and frustrations that the greatest MMO of all time has come to represent. – MB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/world-of-warcraft-classic.jpg","platform":"PC","date":"2019","key":2},{"title":"PUBG","summary":"PUBG didn’t invent the battle royale genre (the holder of that title is tricky to identify). It also didn’t turn it into a global phenomenon (that would be Fortnite). However, PUBG is correctly regarded as the game that converted the battle royale from a rough around the edges genre popular among enthusiasts to a mainstream obsession.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/pubg.png","platform":"PC, PS4, XBO, iOS, Android","date":"2017","key":3},{"title":"XCOM: Enemy Unknown","summary":"Tactical, turn-based games don’t get much better than 2012’s XCOM: Enemy Unknown. The gameplay builds upon the concepts of the 1994 original and is as highly addictive and polished as any game of its ilk. It’s a finely-tuned package whose myriad mechanics work in perfect harmony, from the blinding “Fog of War” to the ever-important “panic” gauge. This is a must-play game for every tactical RPG fan and to this day stands as one of the best examples of the genre. – BB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/xcom-enemy-unknown.jpg","platform":"PC, PS3, X360, Vita, iOS, Android","date":"2012","key":4},{"title":"Outer Wilds","summary":"The universe is going to end in about 20 minutes, and you’re the only person who can stop it. The problem is that you don’t know why the universe is ending, how to stop it, or even where you are. Fortunately, you’re to be stuck in a time loop that allows you infinite tries to discover the answer to all these questions. At a time when open-world games are more about filling empty space with largely hollow objectives, Outer Wilds captures the thrill of discovery, exploration, and figuring things out on your own. – MB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/outer-wilds_0.jpg","platform":"PS4, XBO, PC","date":"2019","key":5},{"title":"Rainbow Six Siege","summary":"It’s a simple concept: one team of players defends a building from the inside, while the other team attempts to infiltrate and eliminate. Ubisoft Montreal squeezed every drop of potential out of the idea and gave us Rainbow Six Siege, a shooter unlike any other. From the balanced tactical gameplay to the destructible environments, the game is calibrated perfectly and breathes new life into the Rainbow Six franchise in a creative, clever way. It’s one of the best close-quarters shooters we’ve played in the last 10 years, and to this day, jumping back into Siege is always an intense affair. – BB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/rainbow-six-siege_0.jpg","platform":"PS4, XBO, PC","date":"2015","key":6},{"title":"New Super Mario Bros. U","summary":"New Super Mario Bros. U’s greatest trick is how it takes advantage of the Wii U’s often underutilized tablet controller. That peripheral opens up a new world of multiplayer manipulation possibilities that has made this game a favorite among co-op gamers. – MB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/new-super-mario-bros-u_0.jpg","platform":"Wii U, Switch","date":"2012","key":7},{"title":"Titanfall","summary":"Jumping into a hulking Titan in Titanfall for the first time is one of the most empowering sensations you’ll ever feel in a video game. It’s flat-out badass to wreck shop and squash foes like ants. Respawn’s multiplayer shooter is notable for its unique take on the genre, which sees players jump into and out of their 20-foot Titans, a feature that adds an incredible amount of depth to the otherwise traditional shooter gameplay. Titanfall is notoriously one of the most underrated franchises in modern gaming, but real fans know what’s up. – BB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/titanfall_0.jpg","platform":"XBO, X360, PC","date":"2014","key":8},{"title":"StarCraft II","summary":"It’s amazing that we finally got a StarCraft sequel this decade. Arriving 12 years after the release of the first game, StarCraft II is set four years after the initial conflict between the Terrans, Protoss, and Zergs, and protagonist Jim Raynor is now at odds with the Arcturus Mengsk, the former rebel leader who’s become emperor fo the Terran Dominion. ","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/starcraft-2_0.jpg","platform":"PC","date":"2010","key":9},{"title":"Mortal Kombat X","summary":"Three great Mortal Kombat games have released between 2010 and 2019, and Mortal Kombat X is the very best of them. After the timey-wimey shenanigans of Mortal Kombat 9 left a whole bunch of fighters dead, it’s up to a new generation of foul-mouthed kids — many of them the offspring of popular characters in the series — to stop a civil war on Outworld that threatens Earthrealm. ","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/mortal-kombat-x_0.jpg","platform":"PS4, XBO, PC, iOS, Android","date":"2015","key":10},{"title":"Untitled Goose Game","summary":"Untitled Goose Game is such a nice note to end the decade on. A casual stealth-puzzler, you play as a mean goose who loves to torment the citizens of an unsuspecting town who just want to go about their business. But this goose isn’t just gonna sit by and let peace and order reign. No, this goose is going to steal your glasses, your keys, an important town landmark, and much more before he’s through. Few games are as funny or exude more charm than this deceptively simple and truly engaging little indie. Honk! – JS","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/untitled-goose-game_0.jpeg","platform":"PS4, XBO, Switch, PC","date":"2019","key":11},{"title":"Dragon Ball FighterZ","summary":"The Dragon Ball franchise has suffered no shortage of tie-in games in the last few decades, but few of them are as good as Arc System Works’ latest fighting game adaptation. Set during the Dragon Ball Super era, this 3v3 fighter features all of your favorite characters from the series as well as an original fighter only found in the game but designed by series creator Akira Toriyama! Dragon Ball FighterZ‘s anime art style is an immediate eye catcher, and its fast-paced combat — including a “Vanish Attack” that allows you to instantly teleport behind your opponent — sets it apart from the competition. – JS","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/dragon-ball-fighterz.jpg","platform":"PS4, XBO, Switch, PC","date":"2018","key":12},{"title":"Splatoon","summary":"Aside from GoldenEye, Nintendo has never been known for its competitive shooters. But that all changed in 2015 with the release of Splatoon, a simple but fun arena shooter that’s age-appropriate and fits snugly into Nintendo’s pantheon of party games. One criticism lobbed at Nintendo over the years is its inability (or perhaps refusal) to create compelling new characters. The Big N has pretty much relied on the same cast of gaming icons for the past 25 years. Fortunately, Splatoon’s Inklings are the best character designs Nintendo has created in years. – BB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/splatoon_0.jpg","platform":"Wii U","date":"2015","key":13},{"title":"The Stanley Parable","summary":"The Stanley Parable isn’t for everyone—it’s bizarre, somewhat disturbing, and actually not very fun to play at all. But it’s also an essential game that everyone should at least play once, if only to expand their personal understanding of what games can be. There’s no combat or real action involved, but it’s a fascinating stroll into the surreal as you guide Stanley through an ever-shifting office space that threatens to swallow him whole. Boundary-pushing doesn’t even begin to describe this instant-classic from developer Davey Wreden. – BB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/the-stanley-parable_0.jpg","platform":"PC","date":"2013","key":14},{"title":"Animal Crossing: New Leaf","summary":"Animal Crossing: New Leaf is one of those Nintendo games (and there are a lot of them) that is so fun to play and works so well that it’s hard to critique. The tried-and-true Animal Crossing formula is expanded in New Leaf in the form of deeper sim and customization options, but for the most part, the game stays true to its predecessors and simply improves upon them in myriad ways. It’s so easy to get lost in this game—from decorating your house to running the town as mayor—that it’s basically impossible to pick it up and not become obsessed with it. – BB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/animal-crossing-new-leaf_0.jpg","platform":"3DS","date":"2013","key":15},{"title":"Halo: Reach","summary":"Bungie’s final Halo game is also one of its best. Featuring a whole new cast of heavily-armored Spartans who must fight to protect the human colony of Reach from the merciless Covenant, this Halo prequel tells the story of what happened right before Master Chief and Cortana crash landed on the Halo ring. Fortunately, Reach doesn’t fall into the usual prequel traps, only nodding to the franchise’s first installment when it really needs to. For the most part, this is a standalone game about the bond between a squad of super-soldiers and the dire situation they’re in. If Halo: ODST, in many ways the precursor to this bigger game, had a decidedly happy ending, Reach takes things in a completely different direction, raising the stakes for its heroes as they desperately try to protect humanity’s last hope from the enemy. ","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/halo-reach.jpg","platform":"X360, XBO, PC","date":"2010","key":16},{"title":"Dragon Quest XI","summary":"The prospect of “getting into” a series by starting with its 11th installment likely strikes you as daunting and absurd. Still, that’s roughly the proposition offered by Dragon Quest XI, a game designed to attract new players while pleasing veteran fans of the series. Remarkably, this game comes fairly close to achieving its loftiest goals. This title’s pure JRPG elements blend well with its modern aesthetics and sensibilities to form an adventure that captures the genre’s very spirit, while also subverting some familiar tropes regarding the hero of legend that will surprise you. It’s a meticulously well-crafted nod to a time gone by as well as a look at what could be. – MB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/dragon-quest-xi.jpg","platform":"PS4, XBO, PC","date":"2017","key":17},{"title":"Beat Saber","summary":"The jury is still out on VR games and devices. While many recognize the potential of the platform, the expectations for what VR is and can be often remains too great to clear. Beat Saber offers an elegant solution to that conundrum.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/beat-saber.jpeg","platform":"PS4, PC","date":"2019","key":18},{"title":"Apex Legends","summary":"Free-to-play multiplayer shooter Apex Legends gave us a new way to experience the popular battle royale genre just as it was starting to feel like there was nowhere left for the genre to go. Indeed, Fortnite and PUBG might be responsible for popularizing battle royale games but Apex Legends perfected the formula with its mix of diverse characters, fast-paced traversal, and creative abilities. ","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/apex-legends.jpeg","platform":"PS4, XBO, PC","date":"2019","key":19},{"title":"Super Mario D World","summary":"It is the secret, horrible fate of every Mario game to be compared to the games that came before it. The result is the elevation of a few series classics that leaves other installments in the series gasping for the air needed to create their own legacies. Still, Super Mario 3D World has always felt like an especially underrated part of the platformer series. It perfectly captures the platforming bliss of the original games while adding a dash of 3D elegance that does not compromise the spirit of the title. In a just world, it would rightfully compete for a spot on the Mt. Rushmore of Mario titles. – MB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/super-mario-3d-world.jpg","platform":"Wii U","date":"2013","key":20},{"title":"God of War","summary":"The original God of War trilogy often feels like a fever dream of vaguely accurate mythology, combo multipliers, and ridiculous violence. Did such an outlandish piece of gaming truly exist?","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/god-of-war-3.jpg","platform":"PS3, PS4","date":"2010","key":21},{"title":"Saints Row: The Third","summary":"As one of the most absurd games of this decade, Saints Row: The Third offered a dizzying array of sights and sounds that often left you laughing, even if it was just because you couldn’t quite process what you were playing. It still stands as the franchise’s finest hour. – MB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/saints-row-the-third.jpg","platform":"PS3, X360, PC, Switch","date":"2011","key":22},{"title":"Middleearth: Shadow of Mordor","summary":"A shining example of a licensed video game done right, Middle-earth: Shadow of Mordor harnesses the power of the Lord of the Rings franchise perfectly. The game itself is super fun to play—scouring the open world for high-ranked orcs and assassinating them with bloody finesse feels great and holds up throughout the entire campaign. Yes, the combat is derivative of Rocksteady’s Batman games, but the Middle-earth milieu helps to set the game apart. And the Nemesis system, in which enemies you fight on the battlefield remember you and interact with you differently on second meeting, remains a major innovation that few other games have been able to replicate. Shadow of Mordor more than does its source material justice, and that’s saying a lot. – BB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/middle-earth-shadow-of-mordor.jpg","platform":"PS4, XBO, PS3, X360, PC","date":"2014","key":23},{"title":"Sekiro: Shadows Die Twice","summary":"Sekiro: Shadows Die Twice is a troll. No, seriously. Look past its stunning graphics, wonderful music, and compelling world, and you’ll see the beating heart of a troll. Those who went into this game expecting more of the Soulsborne formula were likely stunned, watching themselves die and die again at the hands of an early challenge.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/sekiro-shadows-die-twice_0.jpg","platform":"PS4, XBO, PC","date":"2019","key":24},{"title":"The Legend of Zelda: Skyward Sword","summary":"Skyward Sword’s legacy will always be partially based on the things that it failed to do. It never quite took advantage of the Wii’s motion controls, some of its dungeons and bosses felt like last minute additions, and its world structure felt antiquated. Some say that its shortcomings resulted in the innovations of Breath of the Wild.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/the-legend-of-zelda-skyward-sword.jpg","platform":"Wii, Wii U","date":"2011","key":25},{"title":"P.T.","summary":" P.T.’s simple (if often confounding) premise allows its creators, Hideo Kojima and Guillermo del Toro, all the room they need to simply devastate you. Like those nightmares you have where you wander your own home knowing that something isn’t quite right, P.T. seems to live and breathe to scare you at the turn of every corner. Its puzzles are still convoluted oddities to this day, and the woman who haunts the hallways of the house in which the game goes down as one of the greatest horror game villains of all time. – MB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/pt-silent-hills.jpg","platform":"PS4","date":"2014","key":26},{"title":"Nier: Automata","summary":"It’s nearly impossible to describe Nier: Automata without coming across like a first-year film student who just saw their first French New Wave films. So many of the things that this game does well are about the boundaries it pushes and the conventions it shatters with its bold story, strange characters, and entirely unconventional structure.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/nier-automata.jpg","platform":"PS4, XBO, PC","date":"2017","key":27},{"title":"Super Meat Boy","summary":"Super Meat Boy is one of the first modern platformers to embrace that mentality. The joy of this game certainly stems from its challenges, but its greatest trick is the way that it keeps convincing you that one more try will finally be enough to catch that carrot it constantly dangles in front of you over a pit of fire and spikes. – MB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/super-meat-boy.jpg","platform":"X360, PC, PS4, Vita, Switch, Wii U","date":"2010","key":28},{"title":"Shovel Knight","summary":"The biggest pitfall of nostalgia is the fear of loving something that hasn’t aged well. Clinging onto a work or concept that is only elevated when viewed through your eyes is often the very thing that prevents creative works to move forward on a grand scale.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/shovel-knight.png","platform":"Wii U, 3DS, PS4, PS3, XBO, Switch, Vita, PC","date":"2014","key":29},{"title":"Papers, Please","summary":"An exercise in tedium and a fascinating, experiential meditation on bureaucracy and the way it dehumanizes the people it’s designed to serve, Lucas Pope’s Papers, Please is a unique video game to be sure. But more importantly, it’s one of the most unique educational tools ever created. Playing as an immigration officer for the fictional country of Arstotzka is repetitive and somewhat boring, but that’s the point–as you check dozens and then hundreds of immigrants’ papers, you begin to view them not as people with lives, but as blips on a conveyer belt. It’s as frightening as it is enlightening. – BB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/papers-please.jpg","platform":"PC, Vita, iOS","date":"2013","key":30},{"title":"Life Is Strange","summary":"Life Is Strange is an impressive storytelling feat from Dontnod, one of the decade’s most exciting studios, and one of the most important games of its time. Set in the fictional town of Arcadia Bay, Oregon, the game tells the story of estranged teenagers Max and Chloe, who are reunited by a tragedy that will change their lives forever. When Max discovers that she can rewind time, she and Chloe set a catastrophic event in motion that could kill everyone they love and destroy their town. ","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/life-is-strange.jpg","platform":"PS4, XBO, PS3, X360, PC, iOS, Android","date":"2015","key":31},{"title":"Heavy Rain","summary":"Is Heavy Rain perfect? No. Quantum Dream’s three-pronged noir thriller is janky in both presentation and design. But what’s so brilliant about it, the reason we continue to discuss its merits 10 years after its release, is the game’s artistic ambition. Rather than focusing on reaction time and skill, the game presents moral quandaries and risk/reward scenarios that feed into the story, creating an experience that’s both cinematic and narratively malleable. Today, cinematic games are commonplace. But back in 2010, Quantic Dream was breaking new ground. – BB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/heavy-rain.jpg","platform":"PS3, PS4, PC","date":"2010","key":32},{"title":"Injustice","summary":"Don’t look now, but this decade truly advanced the once rightfully maligned art known as the licensed video game. Whereas these titles were once seen as the soulless void of the industry, we’re now seeing licensed titles that not only hold their own but innovate.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/injustice-2.jpg","platform":"-","date":"2017","key":33},{"title":"Destiny","summary":"Bungie’s follow-up to its seminal Halo series may be even more influential than the sci-fi shooter that put the studio on the map. In 2014, Destiny felt like a whole new way to experience a shooter, mixing the excellent gunplay Bungie was already known for with gameplay elements from action RPGs (especially the looting) and MMOs (the multiplayer raids and dungeons).","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/destiny.jpg","platform":"PS4, XBO, PS3, X360","date":"2014","key":34},{"title":"Pokemon X and Y","summary":"In 2013, Pokemon X and Y felt like a celebration of everything that had come before in the series. While not entirely revolutionary, these games arguably represent the most refined and beautiful takes on the Pokemon formula that we’ve ever experienced. It also featured a necessary visual overhaul that brought the franchise into the 3D era as well as introduced 72 new Pokemon to find and train as your own. These 3DS titles expanded the scope of the “typical” Pokemon adventure while recognizing that the heart of this series will always revolve around catching them all. – MB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/pokemon-x-y.jpg","platform":"3DS","date":"2013","key":35},{"title":"Her Story","summary":"Sam Barlow essentially created a new storytelling format with Her Story, his 2015 investigative drama starring Viva Seifert as the wife of a missing man. The gameplay, which revolve around watching interrogation videos and searching through a database, were like nothing seen before, and Barlow and the game were appropriately praised with Game of the Year awards and universal critical acclaim. And that ending…that ending is truly something else. It’s a revelation that sent chills down our spines and proved Barlow to be one of the best storytellers of our generation, regardless of genre or art form. – BB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/her-story.jpg","platform":"PC, iOS, Android","date":"2015","key":36},{"title":"South Park: The Stick of Truth","summary":"If you had told us 10 years ago that one of the best RPGs of the decade would be a South Park game, we wouldn’t have believed you. And yet, here we are, writing about how great South Park: The Stick of Truth is. The turn-based combat is familiar, simple, and fun, and the campaign is full of hilarious jokes and references to the series, all of which were written by the same people who make the show. Playing as the New Kid and exploring South Park, paying homage to fantasy game tropes alongside Cartman, Stan, Kyle, and Kenny, is a blast (fart attacks galore). But jokes aside, the game is well-made and hilarious, and deserves its spot on this list. – BB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/south-park-the-stick-of-truth.jpg","platform":"PS3, X360, PC, PS4, XBO, Switch","date":"2014","key":37},{"title":"Deus Ex: Human Revolution","summary":"Deus Ex: Human Revolution stands as the decade’s greatest vision of a cyberpunk future where the lines between man and machine begin to blur. Adam Jensen is a cybernetically augmented super-soldier tasked with taking down an anti-augmentation terrorist group before it can enact its ultimate plan on the world. But this is no normal “shoot down the bad guys, save the world” assignment for Jensen, who discovers a much deeper rabbit hole during his investigation that leads to one of the world’s most shadowy groups, the Illuminati, the faction that’s been secretly manipulating world events throughout history. ","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/deus-ex-human-revolution.jpeg","platform":"PS3, X360, Wii U, PC","date":"2011","key":38},{"title":"Until Dawn","summary":"A surprisingly fun party game, Supermassive Games’ interactive horror experience Until Dawn took an idea that wasn’t exactly brand new but executed it with a level of quality that has never been seen before. The powerful Decima engine (used in games like Death Stranding and Horizon Zero Dawn) allowed for the developers to render characters that resembled the real-life actors who embodied them. Heroes’ Hayden Panetierre and Agents of S.H.I.E.L.D.’s Brett Dalton are immediately recognizable, which adds exponentially to the game’s cinematic power. The branching, choose-your-own-adventure story is typical horror movie fare, but the element of interactivity greatly elevates the experience. – BB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/until-dawn.jpeg","platform":"PS4","date":"2015","key":39},{"title":"Bastion","summary":"We’ll always think of the narrator when We think of Bastion. To be sure, the game’s use of a reactive narrator who responds to most of your actions is just the kind of hook that indie titles often need to attract the attention required to get people to give them a shot. Of course, even this incredible gimmick would have led to nothing were it not for everything else the game does so well.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/bastion.jpg","platform":"X360, PC, XBO, PS4, Vita, Switch, iOS","date":"2011","key":40},{"title":"Wolfenstein: The New Order","summary":"The 2010s were a time of rebirth for two id shooter franchises. In 2014, Wolfenstein returned with a vengeance, reimagined as The New Order, a game set in an alternate future in which Nazi Germany won World War II and took over the planet with its technologically advanced war machine. With a tip of the hat to the occult horrors of Return to Castle Wolfenstein, this reboot imagines a reality where grotesque Nazi experiments have led to the creation of armored super soldiers capable of wiping out any resistance the remaining freedom fighters throw at them. Enter B.J. Blazkowicz, a Nazi-killing machine who will stop at nothing until every last one of Hitler’s men is dead. It’s really as simple as that. ","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/wolfenstein-the-new-order.jpg","platform":"PS4, XBO, PS3, X360, PC","date":"2014","key":41},{"title":"CounterStrike: Global Offensive","summary":"It’s still amazing that Counter-Strike began its life as a Half-Life mod made by two kids. That mod would soon become one of the most important PC games of all-time.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/csgo.jpg","platform":"PS3, X360, PC","date":"2012","key":42},{"title":"Resident Evil","summary":"Capcom’s remake of Resident Evil 2 is proof that you can’t argue with the classics. This survival horror fan-favorite rises from the grave with revamped graphics and gameplay mechanics, a way more terrifying Mr. X, and an over-the-shoulder camera that puts you closer to the zombie-killing action. This remake isn’t just about reviving what worked in the ’90s but making it new again. ","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/resident-evil-2.jpg","platform":"PS4, XBO, PC","date":"2019","key":43},{"title":"Metroid: Samus Returns","summary":"A remake of Metroid II: Return of Samus, part of Samus Returns’ appeal is the fact that it allows you to experience an adventure that was once only playable on the Game Boy. Considering that Metroid II has long been referred to as one of the best Metroid titles, that’s quite the treat. The game features not only overhauled graphics but also a few new gameplay mechanics, such as a melee counterattack and the new Aeon abilities. Most importantly,At a time when there are simply not enough Metroid games available for current (or recent), consoles, Samus Returns is certainly notable if for no other reason than it offers more of one of the best series in gaming. – MB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/metroid-samus-returns.jpg","platform":"3DS","date":"2017","key":44},{"title":"Mad Max","summary":"An open-world game with fast, killer muscle cars and a giant wasteland to explore, Mad Max is one of the most underrated titles of its kind. Released several months after the sublime Mad Max: Fury Road, Avalanche Studio’s own take on postapocalyptic Australia doesn’t have much to do with the movie and everything to do with building up your death machine on wheels and blowing up as many things as possible. Featuring some of the most refined driving mechanics to date, this end-of-the-world demolition derby in the desert really delivers the insanity previously only seen on the movie screen. There’s also an enjoyable story and a few colorful characters to boot. – JS","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/mad-max.jpeg","platform":"PS4, XBO, PC","date":"2015","key":45},{"title":"Resident Evil","summary":"Around the time of Resident Evil 7’s release, a lot of people started talking about what a Resident Evil game really is. With its first-person gameplay, entirely new characters, and Texas Chainsaw Massacre-inspired setting, many people said that Resident Evil 7 lacked the conventions needed to make it a true RE title.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/resident-evil-7.jpg","platform":"PS4, XBO, Switch, PC","date":"2017","key":46},{"title":"Hotline Miami","summary":"Hotline Miami hit the indie scene like a man in a rooster mask charging into a warehouse full of thugs with a hammer in hand. Your first impression of this title will likely revolve around its trippy soundtrack, overtly ‘80s visuals, and over-the-top violence. This is natural.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/hotline-miami.jpg","platform":"PC, PS3, PS4, Vita, Switch, Android","date":"2012","key":47},{"title":"Hearthstone","summary":"There’s always been something appealing about traditional CCG experiences like Magic: The Gathering, but that appeal has always been tempered by frustrating practicalities. In other words, few people have the money, time, and patience to assemble a deck of physical cards and go out in the world to battle others.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/hearthstone.jpg","platform":"PC, iOS, Android","date":"2014","key":48},{"title":"Control","summary":"Remedy began the decade with a Twin Peaks-inspired mystery about a writer trapped inside his own horror story (more on that later) and ended with something even weirder, if you can believe it. Control is a third-person action-adventure game heavily influenced by the New Weird, an artistic movement that blurs the lines between horror, speculative fiction, and realism. The Finnish studio gives its New Weird vision shape and form inside the Oldest House, the shape-shifting headquarters of the Federal Bureau of Control, a secret government agency in charge of investigating and containing paranormal phenomena.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/control-game.jpg","platform":"PS4, XBO, PC","date":"2019","key":49},{"title":"Fortnite","summary":"Fortnite’s legacy will always be tied into its absurd popularity that led to such things as a cameo in the highest grossing film of all-time. But the truth is that Fortnite is much more than that. It’s the game that not only popularized the battle royale experience but the one title in the age of “live services” that justifies its content releases by consistently reinventing itself and expanding its reach through a series of unique and generally exceptional releases. Here’s the question: is Fortnite the ultimate representation of modern gaming or simply the game that solidified its trends? – MB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/fortnite.jpeg","platform":"PS4, XBO, PC, iOS, Android","date":"2017","key":50},{"title":"The Outer Worlds","summary":"After the disappointing release of Fallout 76, many people were left with the impression that not only was the Fallout franchise in its twilight years but that the ideas it represented were waning as well. The Outer Worlds may not be a “proper” Fallout game, but developer Obsidian used it to effectively resurrect an era ruled by ambitiously advanced RPG series like Fallout and Star Wars: Knight of the Old Republic. The Outer Worlds is its own adventure worth experiencing, but it will forever be remembered as the game that justified your nostalgia for an entire school of RPG game design. – MB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/the-outer-worlds_0.jpg","platform":"PS4, XBO, PC","date":"2019","key":51},{"title":"Fez","summary":"This decade will likely be largely remembered for the rise of the indie video game scene, even if the foundations for that revolution were laid years before. This was the decade that saw a series of small visionary creators deliver experiences that major studios had long since abandoned or never attempted.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/fez-game.jpg","platform":"X360, PC, PS4, PS3, Vita, iOS","date":"2017","key":52},{"title":"Super Mario Maker","summary":"Super Mario Maker was the embodiment of fans’ love for Mario, allowing them to let their imaginations run wild with the game’s robust level editor, which used iconic sprites and assets that spanned Mario’s history of 2D platformers. And the game’s share feature allowed Mario fans to connect like never before, creating and downloading each others’ creations, with some of the levels almost impossible to complete. It’s a wonder why Nintendo didn’t release a game like Super Mario Maker earlier, but nevertheless, the game is a gift to Mario obsessives everywhere. – BB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/super-mario-maker.jpg","platform":"Wii U, 3DS","date":"2015","key":53},{"title":"Telltales The Walking Dead","summary":"The Walking Dead put Telltale’s brand of choice-based adventure storytelling on the map, and for good reason: Clementine and Lee are two of the decade’s most memorable video game characters. This duo’s tragic end amid the zombie apocalypse hit us like a ton of bricks in 2012, and the late game twist is no less hearbreaking almost eight years later. ","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/telltale-the-walking-dead.jpg","platform":"PS4, PS3, XBO, X360, Switch, Vita, PC, iOS, Android","date":"2012","key":54},{"title":"Wolfenstein II: The New Colossus","summary":"It’s almost shocking how thematically rich and character-driven Wolfenstein II: The New Colossus is, considering its more campy roots. The game takes B.J. Blazkowicz into new territory narratively and provides an incisive look into the nature of tyranny and how its philosophies have poisoned America. But what makes Wolfenstein II so darn good is its tight gameplay, which, when combined with the game’s grisly but fun art style, makes for one of the best first-person shooters of the decade. – BB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/wolfenstein-2.jpg","platform":"PS4, XBO, Switch, PC","date":"2017","key":55},{"title":"The Binding of Isaac","summary":"No other genre kicked down the door this decade quite like the roguelike. While its roots can be traced back to the ‘80s game from which it draws its name, the roguelike’s combination of procedurally-generated levels and pseudo-permadeath mechanics spoke to many who came out of the corridor shooter era looking for something more challenging.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/the-binding-of-isaac.jpg","platform":"PC","date":"2011","key":56},{"title":"Far Cry : Blood Dragon","summary":"In retrospect, it’s hard to believe that Ubisoft employees needed to convince the company to let them develop a Far Cry 3 spin-off that effectively turned the game into a particularly brutal Saturday morning cartoon. That just sounds like a recipe for success, and it proved to be just that.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/far-cry-blood-dragon.jpg","platform":"PS3, X360, PC","date":"2013","key":57},{"title":"Limbo","summary":"At a time when many indie games needed some kind of hook to capture the attention of AAA consumers, Limbo’s black-and-white visuals and lovely and moody animations certainly stood out, but this indie proved to be so much more than a living art project. Like Braid before it, Limbo was a declaration that the timeless appeal of the 2D platformer could be used as the vehicle for fascinating new ideas and design concepts. Limbo is a perfectly crafted adventure that proves that personality wins the day in game design. – MB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/limbo.jpeg","platform":"X360, PS3, XBO, PS4, Vita, Switch, PC, iOS, Android","date":"2010","key":58},{"title":"Gone Home","summary":"Haunting, heartfelt, and expertly crafted, The Fullbright Company’s interactive mystery drama Gone Home is just about perfect. The scenario of a young woman returning to her childhood home in Oregon only to find it mysteriously abandoned is initially terrifying, and the game capitalizes on this. But as you explore the house and the truth about her family’s whereabouts is unveiled, the game elegantly morphs into a heartwarming love story between two sisters that’ll have you grabbing for the tissue box. Few games feel as affecting as Gone Home—it’s a privilege to play. – BB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/gone-home.jpg","platform":"PC, PS4, XBO, Switch, iOS","date":"2013","key":59},{"title":"Metal Gear Solid V: The Phantom Pain","summary":"Hideo Kojima’s final Metal Gear game will always be remembered as his most controversial, both for the real-life drama that led to his highly-publicized exit from Konami as well as the cut content that left this installment’s finale feeling somewhat unfinished. But none of this should distract from the fact that this is one of the finest Metal Gear games ever made, thanks to some major improvements to the combat and navigation systems.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/metal-gear-solid-v.jpg","platform":"PS4, XBO, PS3, X360, PC","date":"2015","key":60},{"title":"Diablo","summary":"Oh, Diablo 3. For some, Diablo 3 will always be remembered as the game that launched with server problems, questionable online mechanics, and content that felt lacking in comparison to the legendary Diablo 2. Yet, in a decade that saw so many games benefit from the era of updates, few titles changed their legacy quite as quickly and dramatically as Diablo 3. Thanks to a series of smart patches and the release of a brilliant expansion, Diablo 3 is now rightfully seen by many as a brilliant distillation of Diablo’s best core elements that enhanced the accessibility of the franchise while retaining many of its better qualities. – MB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/diablo-3.jpg","platform":"PC, PS3, X360, PS4, XBO, Switch","date":"2012","key":61},{"title":"Batman: Arkham City","summary":"Batman: Arkham Asylum mixed Metroidvania exploration with its own innovative “freeflow” combat system to change the way we thought about licensed games. Then Arkham City took all of that and added in an open-world full of bad guys, missions to complete, and Batman lore. While the very nature of side-quest-heavy open-world games means that Arkham City‘s story isn’t quite as focused as its spooky, brilliant predecessor’s, this sequel remains the best version of this franchise’s gameplay mechanics. From grappling and soaring over Gotham City’s skyscrapers to venturing into its most hidden depths, this is a game that never gets old, especially if you love the Batman mythos. There are plenty of fan-favorite heroes and villains, as well as quite a few deep cuts, to find here. – JS","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/batman-arkham-city.jpeg","platform":"PS3, X360, Wii U, PS4, XBO, PC","date":"2011","key":62},{"title":"Uncharted : Drakes Deception","summary":"The cargo plane set piece in Uncharted 3: Drake’s Deception was one of the most spectacular things I’d ever laid eyes on when I first played it in 2011. Without cutting, we watch Nathan Drake hop onto the plane from a moving Jeep, fight a gaggle of baddies in the cargo bay, blow up said plane, and then parachute down to safety. That’s Uncharted 3 in a nutshell: It’s an over-the-top action adventure game that’s as good if not better than the movies that inspired it. Nathan, Elena, and Sully are perfect protagonists, and the interpersonal drama between them is just the icing on the cake. – BB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/uncharted-3.jpg","platform":"PS3, PS4","date":"2011","key":63},{"title":"Firewatch","summary":"It’s amazing that we live in a time when a strange little game like Firewatch can make a big splash. It’s a mystery adventure game set in a national park in the late ‘80s that sees you walking and talking and…walking and talking some more. But by god if this game isn’t more riveting and engaging than 90% of games made for 10 times the budget. Firewatch isn’t doesn’t have AAA graphics, but its art style is evocative enough to support the meticulously constructed story, acted insanely well by voice actors Rich Sommer and Cissy Jones. – BB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/firewatch.jpeg","platform":"PS4, XBO, Switch, PC","date":"2016","key":64},{"title":"Alan Wake","summary":"A writer visits a small town to battle writer’s block and escape the expectations of his next release. During this trip, he finds himself in the middle of a supernatural catastrophe created by his own mind. This is basically a Stephen King game.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/alan-wake.jpg","platform":"X360, PC","date":"2010","key":65},{"title":"Uncharted : A Thiefs End","summary":"At least for now, Uncharted 4 seems to be the final adventure in Nathan Drake’s years-long quest for treasure. He ultimately found what he was looking for in his own family, a powerful farewell for the series that speaks to the storytelling prowess of the mighty Naughty Dog.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/uncharted-4.jpg","platform":"PS4","date":"2016","key":66},{"title":"Undertale","summary":"Few games released this decade inspired quite the passion that Undertale ignited. While the most adamant of Undertale fans have adopted a sometimes unfortunate Rick and Morty-esque love for this title, there’s no denying that it’s worthy of such enthusiasm.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/undertale.jpeg","platform":"PC, PS4, Vita, Switch","date":"2015","key":67},{"title":"Cuphead","summary":"Cuphead‘s 1930s animation-inspired art style is extraordinary, an early Walt Disney fever dream that looks unlike anything else released this decade. The game’s visuals are spectacular, full of hand-drawn characters, confections, and environments that leave you wanting more games cut from the same cloth. But what makes the game a classic is its tight bullet-hell gameplay, which can be punishing but is always fair to the player. It was a risk for StudioMDHR to develop such an artistically out-there title, but the gaming community thankfully embraced Cuphead wholeheartedly. – BB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/cuphead.jpg","platform":"XBO, PC, Switch","date":"2017","key":68},{"title":"Assassins Creed IV: Black Flag","summary":"Assassin’s Creed Odyssey is a masterclass of open-world design, but we stan pirates. After bringing the series’ original story to a close, Ubisoft had to figure out new territory to explore. Luckily, it still had most of human history to ape from, including the golden age of pirates, who stalked the Caribbean for treasure in the 1700s. With a minimal connection to the previous games, making this installment a perfect jumping on point for new players, Black Flag set sail for a big adventure on the high seas, and it’s still one of the most memorable tales the franchise has produced. This game lets you truly live your pirate fantasies: dig for buried treasure, pillage enemy fortresses, command your men in hectic ship battles, and drink rum. Oh, and you can do some parkour-heavy assassin stuff, too. – JS","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/assassins-creed-4-black-flag.jpg","platform":"PS3, X360, Wii U, PS4, XBO, Switch, PC","date":"2013","key":69},{"title":"Dead Space","summary":"Nothing will ever top the original Dead Space, a masterpiece of both horror atmosphere and storytelling, but this sequel is a very close second. Dead Space 2 picks up where the first game left off, setting up a new nightmare for former ship engineer Isaac Clarke to survive, this time on a space station orbiting one of Saturn’s moons. The game assaults players from its shocking opening scene and doesn’t let up until the credits roll, giving Isaac plenty of Necromorphs to decapitate, dismember, and blow up. It’s a decidedly more action-y adventure with a more seasoned monster-killer but it has no shortage of scares along the way. This one also features one of the most gruesome playable sequences ever put in a video game. We love to see it. – JS","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/dead-space-2.jpg","platform":"PS3, X360, PC","date":"2011","key":70},{"title":"Call of Duty: Black Ops","summary":"Black Ops is not only the best Call of Duty game of the decade but perhaps the best in the entire series of first-person shooters. A slightly trippy, paranoia-filled campaign takes the Call of Duty story into new avenues where even reality is called into question. If the first Modern Warfare was Infinity Ward’s major push towards “realism,” then Black Ops is the total opposite, a fever dream of a shooter told as if it were coming from the mouth of a conspiracy theorist. Who really killed JFK? You’ll find out here. ","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/call-of-duty-black-ops.jpg","platform":"PS3, X360, Wii, DS, PC","date":"2010","key":71},{"title":"The Legend of Zelda: A Link Between Worlds","summary":"Time will tell what the legacy of the 3DS will be, but you get the feeling that the device will always be partially defined by the relative failures of its core technological gimmick. However, the 3DS also deserves to be remembered as the platform that brought us some of Nintendos’ best handheld titles.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/the-legend-of-zelda-a-link-between-worlds.jpg","platform":"3DS","date":"2013","key":72},{"title":"Fallout","summary":"In hindsight, a sequel to Bethesda’s bold reinvention of the Fallout series was inevitable, but back in 2015, it seemed like it would never come. While it doesn’t exactly top its predecessor as an all-time great game, Fallout 4 gets most of Fallout 3‘s innovations right, and has a twisting, entertaining story to boot. This sequel moves the action from the Capital Wasteland to Boston, where the shadow of the mysterious, technologically-advanced Institute looms over the rest of postapocalyptic society. You play as a Vault Dweller who is initially searching for their son but is soon thrust into a much bigger conspiracy involving artificial intelligence and much more. ","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/fallout-4.jpg","platform":"PS4, XBO, PC","date":"2015","key":73},{"title":"Mass Effect","summary":"How do you wrap up a story as massive as Mass Effect‘s? About as well as BioWare did in 2012. While it’s impossible to please everyone, Mass Effect 3 does its best to tie up all of the loose ends from the first two games while also giving Shepard and a few returning favorites satisfying arcs of their own. But this final fight against the merciless Reapers is bigger than any one character, and Mass Effect 3 feels appropriately epic, with big, explosive action sequences and galaxy-altering life or death decisions (perhaps to a fault). Taken on its own, without all of the story baggage, Mass Effect 3 is a great action RPG that will thrill you and break your heart in turn. – JS","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/mass-effect-3.jpg","platform":"PS3, X360, Wii U, PC","date":"2012","key":74},{"title":"Horizon Zero Dawn","summary":"What’s most notable about Horizon Zero Dawn are its living, breathing, insanely detailed environments. Perhaps only The Witcher 3: Wild Hunt can rival the beauty and dynamism of Horizon’s open world, created with Guerrila Games’ powerful Decima engine. It’s breathtaking to see a storm cloud approaching as Aloy tracks down her prey on the open plains, and then to see the environment around you change organically, altering the experience in a way that’s beyond cosmetic. The game’s story is unique and well-written, its art style is extraordinary and strange, and Aloy is one of the coolest, most fully-realized female protagonists of this generation. – BB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/horizon-zero-dawn.jpg","platform":"PS4","date":"2017","key":75},{"title":"Minecraft","summary":"Few games in the past decade have had the cultural impact that Minecraft had. It transcended generations, spawned an endless line of toys, clothing, and merchandise, and became the best-selling video game EVER. And it’s all due to Mojang’s brilliant idea to create a gaming sandbox that was truly wide open but required a measure of inventiveness, and imagination to enjoy to the fullest.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/minecraft.jpeg","platform":"PC, PS4, PS3, XBO, X360, Switch, Wii U, 3DS, Vita, iOS, Android","date":"2011","key":76},{"title":"Marvels SpiderMan","summary":"The rise of the MCU hasn’t exactly been well represented in the world of video games. Quite frankly, it’s impossible to feel like the lack of notable Marvel video games during the MCU era is a missed opportunity that deprived us of some potentially notable experiences.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/spider-man-ps4.jpg","platform":"PS4","date":"2018","key":77},{"title":"Overwatch","summary":"Overwatch was only Blizzard’s fourth entirely original property and, as such, was released under the weight of some considerable expectations. As hard as it may be to remember now, there were also some who felt that Overwatch could never live up to the expectations set by fellow team-based shooter, Team Fortress 2.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/overwatch.jpg","platform":"PS4, XBO, Switch, PC","date":"2016","key":78},{"title":"Stardew Valley","summary":"Stardew Valley‘s success isn’t entirely based on its addictive gameplay loop, depth, colorful visuals, incredible soundtrack, or even its surprisingly deep story. It’s how the game encourages you to experience it.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/stardew-valley.jpg","platform":"PC, PS4, XBO, Switch, Vita, iOS, Android","date":"2016","key":79},{"title":"Bloodborne","summary":"It would have been so easy for Bloodborne to be another Dark Souls game. From a business standpoint, we doubt that Sony would have balked at the idea of a PS4 exclusive Dark Souls game. From a creative standpoint, it’s clear that Dark Souls still had plenty left in the tank.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/bloodborne.jpg","platform":"PS4","date":"2015","key":80},{"title":"Journey","summary":"Unlike other forms of entertainment, video games are evolving in wild, wondrous ways all the time, and Journey represents a true paradigm shift. It’s a ravishing game that’s not chaotic, but serene. Not competitive, but empathetic. Not rigid, but nebulous. Thatgamecompany harnessed the power of video games as an art form to create an experience that’s emotional, but in an abstract, almost primal way. When the story reveals itself in full at the game’s conclusion, it’s a revelation.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/journey.jpg","platform":"PS3, PS4, PC, iOS","date":"2012","key":81},{"title":"DOOM","summary":"While we were initially skeptical about a “modern retelling” of the Doom series back in 2016, the final product quickly put us at ease. Doom not only recaptures the spirit of the action-packed, gory originals but makes all of the series’ trademark ingredients feel fresh again. With only hints of a story tying this murderous rampage through a demon-infested Mars together, this reboot is really all about the fast-paced gameplay, gruesome monsters, fiery atmosphere, and tight level design. There are no conceits or pretensions here. Run into a room, kill all the demons inside of it, destroy the portal to Hell, and repeat. It’s that simple and, with all of the various weapons and sharp things to kill the monsters with, it’s that fun. – JS","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/doom.jpg","platform":"PS4, XBO, Switch, PC","date":"2016","key":82},{"title":"Red Dead Redemption II","summary":"It would have been easy for Rockstar to deliver just another Red Dead Redemption game and bask in the accolades. While some people (mostly) jokingly referred to Red Dead Redemption as GTA with horses, that basic formula still resulted in an undeniably enjoyable experience that doubled as the best western game ever released up to that point.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/red-dead-redemption-2.jpg","platform":"PS4, XBO, PC, Stadia","date":"2018","key":83},{"title":"BioShock Infinite","summary":"BioShock: Infinite’s legacy will always be associated with controversy. The game’s themes, characters, worlds, and mechanics have firmly divided everyone who has played. Despite its divisive design, BioShock Infinite remains a game that is worth remembering, debating, and, ultimately, playing. It’s a bold title that tackles some tricky issues with questionable tenacity, but it never fails to present its most divisive topics as part of a cohesive world that feels like the fully-realized consequence of some pretty strange ideas. It also happens to feature arguably the best uses of licensed music in video game history. – MB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/bioshock-infinite.jpg","platform":"PS4, X360, PC","date":"2013","key":84},{"title":"Rocket League","summary":"Picking up a controller and playing Rocket League for the first time is an unforgettable experience. This game, which fuses soccer with fast, high-flying cars that are prone to exploding, just feels so good to play. The controls are as responsive as can be, and the rules are so simple that players are freed up to focus on having fun rather than futzing around with how the hell the game works.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/rocket-league.jpg","platform":"PS4, XBO, Switch, PC","date":"2015","key":85},{"title":"Super Smash Bros. Ultimate","summary":"You could argue that the initial appeal of the Super Smash Bros. franchise lies in the novelty of seeing so many famous characters share the same screen. As that novelty faded over the years, though, Super Smash Bros. became much more about the incredible fighting mechanics that inspired one of the more surprising competitive scenes in recent years.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/super-smash-bros-ultimate.jpeg","platform":"Switch","date":"2018","key":86},{"title":"Dark Souls","summary":"Dark Souls is the most influential game of the decade. In the midst of an era where highly-scripted corridor shooters ruled the day and fulfilled that fabled promise of allowing people to experience video games that felt just like the movies, Dark Souls offered a more obscure story, environments that truly encouraged you to explore them, and a level of difficulty that would soon become infamous.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/dark-souls.jpg","platform":"PS3, X360, PS4, XBO, Switch, PC","date":"2011","key":87},{"title":"Fallout: New Vegas","summary":"Fallout 3 was an incredible game, but it was clear that Bethesda was limited by the burden of translating some of Fallout’s core concepts into a 3D world. As such, so many of the more subtle and complicated things that the Fallout series truly excelled at in its earliest incarnations didn’t exactly survive the initial transition.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/fallout-new-vegas.jpg","platform":"PS3, X360, PC","date":"2010","key":88},{"title":"Mass Effect","summary":"Mass Effect 2 is not only the best installment in BioWare’s space opera-inspired action RPG series but one of the greatest space-themed games of all time. Following up a video game marvel like Mass Effect, which allowed players to explore ancient galactic civilizations and uncharted planets like they were the captain of the USS Enterprise, was no easy task but Mass Effect 2 managed to deliver on its promise and then some. Tighter third-person shooter controls, more focused storytelling, inspired level design, and a colorful cast of characters that not only emphasized the paragons but also the renegades helped this sequel majorly improve on its predecessor. The game also begins with one of the best opening act twists ever. You won’t see it coming. – JS","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/mass-effect-2.jpg","platform":"PS3, X360, PC","date":"2010","key":89},{"title":"The Witcher : Wild Hunt","summary":"The Witcher 3: Wild Hunt has been called the greatest RPG and open-world game ever made. While such declarations are usuallymade by the title’s most adamant fans, at the very least, The Witcher 3 excels like no other game before (or possibly since) when it comes to crafting a world where it feels like every character, side story, and out-of-the-way locale is worth interacting with. There is no such thing as a wasted narrative moment in this title, and every quest is worth experiencing. The Witcher 3 proves to be one of the most interesting uses of the open-world format in terms of advancing our ideas of storytelling in a video game. – MB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/the-witcher-3.jpeg","platform":"PS4, XBO, Switch, PC","date":"2015","key":90},{"title":"Mario Kart","summary":"When it comes to kart racing, a genre that was surprisingly fruitful in the second half of the decade, there is no better entry than Mario Kart 8, a jam-packed Nintendo racer that adds new twists to the classic series while also celebrating its long history. Most impressive is the plethora of both original and fan-favorite tracks included in the game as well as the customization options that allow you shape your kart however you like. Best played with friends but offering a good challenge at the 200cc difficulty level, you’ll lose hours zipping through the game’s 48 courses, as you unlock new characters and vehicle parts. This is the ultimate party game. – JS","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/mario-kart-8.jpeg","platform":"Wii U, Switch","date":"2014","key":91},{"title":"The Elder Scrolls V: Skyrim","summary":"The Elder Scrolls V: Skyrim is a language unto itself. The simple utterance of phrases like “Dragonborn” or even obscure memes like “Arrow in the knee” are sure to break the dam and unleash a surge of memories upon the millions (and millions) that experienced this game. Skyrim represents Bethesda’s perfect middle-ground between the sometimes overly complicated open-world RPGs of their early days and the sometimes overly simplified open-world RPGs of their recent years. It’s a bountiful title based on gameplay that will hook veterans and new fans alike as they make their way through a world that always feels like its hiding its best surprise around the next corner. – MB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/skyrim.jpg","platform":"PS3, X360, PS4, XBO, Switch, PC","date":"2011","key":92},{"title":"Grand Theft Auto V","summary":"Few games have captured the insanity of modern life better than Grand Theft Auto V. But Rockstar’s only GTA title of the decade not only captures the mayhem of a tech-boomed, celebrity-obsessed society, it laughs at the whole mess. Here is a game that’s as surreal and psychedelic as it is a comment on wealth inequality, our unchecked consumerism, and our addiction to social media. It’s also a hell of a lot of fun to play, with some of the best missions ever produced in the series. ","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/grand-theft-auto-5.jpg","platform":"PS3, X360, PS4, XBO, PC","date":"2013","key":93},{"title":"Super Mario Odyssey","summary":"The Super Mario Galaxy games were so utterly immaculate that it was hard to imagine how Super Mario Odyssey, which looked to be cut from the same cloth, could possibly improve upon its predecessors. But Nintendo exceeded expectations and gave us what is arguably the greatest 3D platformer ever made.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/super-mario-odyssey_0.jpg","platform":"Switch","date":"2017","key":94},{"title":"Red Dead Redemption","summary":"The 2010s are bookended by Red Dead Redemption games, and the first remains a stunning achievement of open-world gaming and atmosphere. Until its successor arrived eight years later, few titles had ever captured the dangerous, desolate, and dusty atmosphere of the Wild West quite like Red Dead Redemption, which ironically is a tale about the end of this era of American history.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/red-dead-redemption.jpg","platform":"PS3, X360","date":"2010","key":95},{"title":"God of War","summary":"God of War could have gone wrong in so many ways. The idea of turning a series known for its absurd mythological stories and gratiutous sex and violence into a nuanced adventure that explores the more intimate aspects of human relationships amid the backdrop of a battle between gods sounds like an admirably ambitious recipe for failure.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/god-of-war.jpg","platform":"PS4","date":"2018","key":96},{"title":"Portal","summary":"Portal 2 expands and builds upon the ingenious puzzle-shooter gameplay of its predecessor in marvelous ways. Each new feature—co-op play, gels, lasers, tractor beams—is weaved into the fabric of the core gameplay perfectly. But the true beauty of Portal 2 is its story and characterizations. Stephen Merchant’s Wheatley is one of the best characters to ever grace a game, period, and GLaDOS and Chell’s unlikely arrangement in the game’s final act is just fantastic (and don’t forget Atlas and P-Body!). Valve created a masterpiece in Portal, but Portal 2 takes The Cake. – BB","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/portal-2.jpg","platform":"PS3, X360, PC","date":"2011","key":97},{"title":"The Last of Us","summary":"Does The Last of Us feature the greatest video game story ever told? There’s a healthy debate to be had on that subject, but there’s no doubt that a big part of the reason why The Last of Us is rightfully remembered by many as one of the best of the decade is because of its story about a man named Joel and a girl named Ellie who are both just trying to find a reason to soldier on in a world devoid of hope.","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/the-last-of-us.jpg","platform":"PS3, PS4","date":"2013","key":98},{"title":"The Legend of Zelda: Breath of the Wild","summary":"The game that launched Nintendo’s latest console into major financial success is also one of the best RPGs the company has ever produced. The Legend of Zelda: Breath of the Wild not only brought the classic Zelda formula to a new generation but seemingly perfected it by giving us a huge open-world sandbox to explore and experiment in. This version of Hyrule is bright, charming, and full of surprises, a living and breathing world made up of diverse environments with their own wild life and ecosystems to discover. And the setting is complented perfectly by a darker, Majora’s Mask-like story in which Link and Princess Zelda have already failed to stop Ganon. ","img":"https://www.denofgeek.com/wp-content/uploads/2019/12/the-legend-of-zelda-breath-of-the-wild.jpg","platform":"Switch, Wii U","date":"2017","key":99}]